
#A- Input مدخلات من المستخدم ------->  Processing بيحصل------->output مخرجات
//B- Data -------> transform -------> data     اغلب البرامج بتاخد بيانات وتقوم بتحويلها من تفاعل المستخدم معها
#C- ممكن المدخلات input تكون من خلال keyboard, mouse, files from hard-disk, network ...etc
//D- المخرجات بتكون من خلال  screen, printing, files, ....
#E- التعليقات comments 
//E1-علامة # أو //  تعتبر تعليق فى لغة الرينج لسطر واحد
#E2- يمكن تحويل مجموعة أسطر لتعليق بوضع /* بالشكل التالى (نفتحها ثم نغلقها ) هكذا 
 /*
.
.
F- علشان نستقبل مدخل من المستخدم
G- see امر للطباعة على الشاشة
H- give امر يجعل المستخدم يدخل قيمة
.
.
*/
# برنامج يرحب بالمستخدم 

see "Hello, Welcome To My First Program" + nl    //   (+ nl ) لانهاء السطر وبداية سطر جديد 
see "Enter Your Name :"                                          
give name                                                                            # وضع متغير يحمل القيمة المدخلة اسمه name
see "Hello " + name  
 #  لاحظ اضافة اشارة +  لدمج المتغير المدخل من خلال المستخدم مع رسالة ترحيب - لاحظ مسافة بعد رسالة الترحيب ظهرت فى المخرجات
# ملاحظة مهمة جدا ان الامر give بيخزن متغيرات من النوع string اى جمل نصية

#انواع المتغيرات 
